 Scraping Amazon website
• Importing Libraries
• Adding Headers
• Requesting url
• Getting Response
• Accessing the Code
• Prettify the Code
• Finding All Division Class That Contains the Details
• Finding The Number of Division Class
• Printing Those Division Class
• Creating Empty List
• Accessing Required Information
• Converting Into DataFrame
• Removing Irrelevant values
• Saving to CSV File
Scraping website - Amazon

In [2]:
import pandas as pd
from bs4 import BeautifulSoup
import requests

In [3]:
headers = {
    'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.124 Safari/537.36'
}

In [4]:
import numpy as np
import pandas as pd
np.random.seed(1)
n=100
data=({"ID":id for id in range(1,n+1)},
      {"Name:":np.random.choice(['Alice','Bob','Charlie','David','Eva','Frank','Grace','Hannah'],n)},
      {"Age":np.random.randint(18,65,n)},
      {"score":np.random.randint(0,100,n)})
df=pd.DataFrame(data)
print(df.head())

      ID                                              Name:  \
0  100.0                                                NaN
1    NaN  [Frank, David, Eva, Alice, Hannah, Bob, David,...
2    NaN                                                NaN
3    NaN                                                NaN

                                                 Age  \
0                                                NaN
1                                                NaN
2  [55, 37, 56, 26, 50, 52, 28, 41, 33, 41, 43, 2...
3                                                NaN

                                               score
0                                                NaN
1                                                NaN
2                                                NaN
3  [77, 56, 59, 15, 24, 9, 66, 71, 53, 69, 36, 21...

In [10]:
np.random.seed(1)
n = 20

ids = np.arange(1, n+1, 5)
data = {
    "ID": ids,
    "Name": np.random.choice(['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Hannah'], len(ids)),
    "Age": np.random.randint(18, 65, len(ids)),
    "score": np.random.randint(0, 100, len(ids))
}
df = pd.DataFrame(data)
print(df)

   ID   Name  Age  score
0   1  Frank   27     64
1   6  David   29     16
2  11    Eva   23      1
3  16  Alice   33     76

In [12]:
df['new_column'] = 50
df['new_column'] = [2,4,5,6]
print(df.head())
df

   ID   Name  Age  score  new_column
0   1  Frank   27     64           2
1   6  David   29     16           4
2  11    Eva   23      1           5
3  16  Alice   33     76           6

   ID   Name  Age  score  new_column
0   1  Frank   27     64           2
1   6  David   29     16           4
2  11    Eva   23      1           5
3  16  Alice   33     76           6